{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-USER",
    "2": "I-USER",
    "3": "B-SRC_IP",
    "4": "I-SRC_IP",
    "5": "B-HOST",
    "6": "I-HOST",
    "7": "B-PROCESS",
    "8": "I-PROCESS",
    "9": "B-ACTION",
    "10": "I-ACTION"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-ACTION": 9,
    "B-HOST": 5,
    "B-PROCESS": 7,
    "B-SRC_IP": 3,
    "B-USER": 1,
    "I-ACTION": 10,
    "I-HOST": 6,
    "I-PROCESS": 8,
    "I-SRC_IP": 4,
    "I-USER": 2,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.3",
  "vocab_size": 30522
}
